---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AntiparallelRampRisersError
source: html/5940680a-e7ce-8034-66ce-1dd71034ddd6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AntiparallelRampRisersError Property

Riser lines are parallel but not collinear. Can't build Run between these Risers.

## Syntax (C#)
```csharp
public static FailureDefinitionId AntiparallelRampRisersError { get; }
```